# MySQL connection with python
PostgreSQL, also known as Postgres, is a free and open-source relational database management system emphasizing extensibility and SQL compliance. It was originally named POSTGRES, referring to its origins as a successor to the Ingres database developed at the University of California, Berkeley.

In [64]:
#!/usr/bin/python

try:
    import mysql.connector as mysql
    import pandas as pd
    import pandas.io.sql as psql
    import numpy as np
    from matplotlib import pyplot as plt
    from IPython.display import display
    import os
    #import pandas_profiling as pp
    
    
    
    host="127.0.0.1"
    database="lms2"
    user="root"
    password=""
    conn= mysql.connect(
        host=host,
        user=user,
        password=password,
        database=database)


    print ("Opened database successfully")

except Exception as e:
    print(e)

Opened database successfully

## Here we can make sure that the all rows and columns are displayed.

In [65]:
pd.options.display.max_rows = None
pd.options.display.max_columns = None

### Only use this in order to create tables

In [66]:
###use this query to create tables
"""cur = conn.cursor()
cur.execute('''CREATE TABLE COMPANY
      (ID INT PRIMARY KEY     NOT NULL,
      NAME           TEXT    NOT NULL,
      AGE            INT     NOT NULL,
      ADDRESS        CHAR(50),
      SALARY         REAL);''')
print("Table created successfully")""

SyntaxError: EOF while scanning triple-quoted string literal (Temp/ipykernel_12056/635071145.py, line 9)

### Run queries

In [71]:
mycursor = conn.cursor()
query = """

SELECT * 
FROM student

;




"""

data = psql.read_sql(query, conn)
data

   first_name  last_name  age             country
0        Joel  Rodriguez   27       United States
1        Joel  Rodriguez   27       United States
2      Moises  Rodriguez   25  Dominican Republic
3      Moises  Rodriguez   25  Dominican Republic
4       Alan   Dershwitz   80       United States
5       Alan   Dershwitz   80       United States
6       Sarai  Rodriguez   30  Dominican Republic
7       Sarai  Rodriguez   30  Dominican Republic
8     Tucker     Carlson   50       United States
9     Tucker     Carlson   50       United States
10         NT     Wright   45      United Kingdom

In [72]:
mycursor = conn.cursor()
query = """

SELECT * 
FROM student
limit 5;




"""

data = psql.read_sql(query, conn)
data

  first_name  last_name  age             country
0       Joel  Rodriguez   27       United States
1       Joel  Rodriguez   27       United States
2     Moises  Rodriguez   25  Dominican Republic
3     Moises  Rodriguez   25  Dominican Republic
4      Alan   Dershwitz   80       United States

### Description of the data.
This only applies to numeric values

In [68]:
data.describe()

            age
count   5.00000
mean   36.80000
std    24.17023
min    25.00000
25%    25.00000
50%    27.00000
75%    27.00000
max    80.00000

### Convert your results into a Json file

In [27]:
### table, records,split,index,columns,values
print(data.to_json(orient ='table'))

{"schema":{"fields":[{"name":"index","type":"integer"},{"name":"first_name","type":"string"},{"name":"last_name","type":"string"},{"name":"age","type":"integer"},{"name":"country","type":"string"}],"primaryKey":["index"],"pandas_version":"0.20.0"},"data":[{"index":0,"first_name":"Joel","last_name":"Rodriguez","age":27,"country":"United States"},{"index":1,"first_name":"Joel","last_name":"Rodriguez","age":27,"country":"United States"},{"index":2,"first_name":"Moises","last_name":"Rodriguez","age":25,"country":"Dominican Republic"},{"index":3,"first_name":"Moises","last_name":"Rodriguez","age":25,"country":"Dominican Republic"},{"index":4,"first_name":"Alan ","last_name":"Dershwitz","age":80,"country":"United States"}]}

### Prepare an extensive profile of your data

In [ ]:
#profile = pp.ProfileReport(data)
#profile.to_file("output1.html")
#profile = pp.ProfileReport(data)
#profile.to_file("output1.html")

# Make sure you close your connection.
If we don't close the connection, it will lead to connection memory leakage. Unless/until application server/web server is shut down, connection will remain activate even though the user logs out.

There are additional reasons. Suppose database server has 10 connections available and 10 clients request for the connection. If the database sever grants all of them, and after their usage they are not closed, the database server would not be able to provide a connections for another request. For that reason we need to close them - it is mandatory.

Furthermore, it might lead to some mischievous activities regarding the integrity of the database. https://stackoverflow.com/questions/25864235/why-we-should-close-the-connection-in-jdbc-if-we-dont-do-it-what-will-happen

In [73]:
try:
    conn.commit()
    conn.close()
    print("connection has been closed!!")
except: 
    print("connection already closed")

connection has been closed!!